<h1>PANDAS</h1>

In [1]:
import pandas as pd

<h2>Creating DataFrame</h2>

In [9]:

dict = {
    'Name': ['Alzeb','Ram','Sakeena'],
    'Age':[19,21,17],
    'Gender':['M','M','F']
}

In [5]:
df = pd.DataFrame(dict)

In [6]:
df

      Name  Age Gender
0    Alzeb   19      M
1      Ram   21      M
2  Sakeena   17      F

<h2>Using csv file and applying built in functions on them</h2>

In [33]:
df1 = pd.read_csv("Arindam.csv")

In [34]:
df1

   Unnamed: 0  Train No.  Speed      city
0           0      12322     50  Bareilly
1           1      12534    123   Madurai
2           2     125654     67    Bhopal
3           3     564523     87     Bihar

In [35]:
df1['city'] # Selecting Column

0    Bareilly
1     Madurai
2      Bhopal
3       Bihar
Name: city, dtype: object

In [36]:
df1.loc[0] # Selecting Row

Unnamed: 0           0
Train No.        12322
Speed               50
city          Bareilly
Name: 0, dtype: object

In [37]:
# Adding coloumn
df1['name'] = ["Ram","Shyam","Mohit","Alzeb"]

In [38]:
df1

   Unnamed: 0  Train No.  Speed      city   name
0           0      12322     50  Bareilly    Ram
1           1      12534    123   Madurai  Shyam
2           2     125654     67    Bhopal  Mohit
3           3     564523     87     Bihar  Alzeb

In [40]:
# Removing Column 
df1.drop('Unnamed: 0',axis = 1,inplace=True)

In [41]:
df1

   Train No.  Speed      city   name
0      12322     50  Bareilly    Ram
1      12534    123   Madurai  Shyam
2     125654     67    Bhopal  Mohit
3     564523     87     Bihar  Alzeb

In [42]:
df1.describe()

           Train No.       Speed
count       4.000000    4.000000
mean   178758.250000   81.750000
std    262656.956449   31.383382
min     12322.000000   50.000000
25%     12481.000000   62.750000
50%     69094.000000   77.000000
75%    235371.250000   96.000000
max    564523.000000  123.000000

In [43]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Train No.  4 non-null      int64
 1   Speed      4 non-null      int64
 2   city       4 non-null      object
 3   name       4 non-null      object
dtypes: int64(2), object(2)
memory usage: 260.0+ bytes

In [49]:
# Selecting a row
df1.loc[df1['city'] == 'Bareilly']

   Train No.  Speed      city name
0      12322     50  Bareilly  Ram

In [51]:
# Select coloumn
df1[['Speed','name']]

   Speed   name
0     50    Ram
1    123  Shyam
2     67  Mohit
3     87  Alzeb